#+TITLE: Aurélien Bottazini's Emacs configuration
#+OPTIONS: toc:4 h:4
#+PROPERTY: header-args :results silent :tangle yes

I like to use a dark background.
This is setup on my terminal through the terminal color settings.
However if I use the Emacs GUI I need to make sure the colors match
what my terminal settings are.
#+begin_src emacs-lisp
(when (display-graphic-p)
  (set-face-background 'default "#282c34")
  (set-face-foreground 'default "#dcdfe4"))
#+end_src

I  use Vim keybindings everywhere except with special modes
like Magit, Dired... I setup those special modes to start with Emacs
keybindings by default. If for any reason I encounter other modes
where the Vim keybindings are interfering too much, I can disable the
Vim keybindings with ~evil-toggle-key~
#+BEGIN_SRC emacs-lisp
(setq evil-toggle-key "C-c e")
#+END_SRC


#+BEGIN_SRC emacs-lisp
(defun my-prog-mode-auto-fill-hook ()
  (setq fill-column 80)
  (set (make-local-variable 'comment-auto-fill-only-comments) t)
  (auto-fill-mode t))
(add-hook 'prog-mode-hook 'my-prog-mode-auto-fill-hook)
#+END_SRC

** Tags

   Tags are generated through a [[file:~/dotfiles/git/.git_template/hooks/post-commit::.git/hooks/create_ctags%20>/dev/null%202>&1%20&][git hook]] with [[https://ctags.io/][Universal ctags]].

   To make sure my hooks are used I delete the hooks directory
   ~./git/config~ and run ~git init .~ again from the concerned project
   directory.

   My [[file:~/dotfiles/git/.git_template][templates]] are used thanks to the [[~GIT_TEMPLATE_DIR][~GIT_TEMPLATE_DIR~]] environment variable.
   #+begin_src shell :results output
   env | grep GIT_TEMPLATE_DIR
   #+end_src

   #+RESULTS:
   : GIT_TEMPLATE_DIR=/home/auray/.git_template

   I install Universal ctags with
   #+begin_src shell :results output
   brew install --HEAD universal-ctags/universal-ctags/universal-ctags
   #+end_src

   To verify you have the proper version of universal ctags run
   #+begin_src shell :results output
   ctags --version | grep -q "Universal Ctags" >/dev/null && echo "Universal ctags is installed" || echo "Missing Universal ctags"
   #+end_src

   #+RESULTS:
   : Universal ctags is installed

   These are my two go commands to navigate between code references.
   #+begin_src emacs-lisp
   (use-package evil
     :bind (:map evil-normal-state-map
                   ("g." . xref-find-definitions)
                   ("gr" . xref-find-references)))
   #+end_src

